[
    {
        "thumbnail": "assets/posts/ChatGPT.jpeg",
        "http": "https://github.com/areenkh/ca02",
        "date": "05-14-2023",
        "internationalizations": [
            {
                "language": "en",
                "title": "Creative Express App with chatGPT.",
                "description": "Developed a full-stack web app, utilizing Express, Mongoose, and MongoDB, to integrate OpenAI's chatGPT API. Enabled generation of accurate responses to user queries while implementing user authentication and secure data storage. Demonstrated expertise in backend and frontend development with EJS and MongoDB."
            },
            {
                "language": "pt",
                "title": "A fórmula de matriz 2D anti-deslocamento.",
                "description": "Você já pensou na <b>relação matemática</b> entre as<i> colunas</i> e as <i>linhas</i> de uma matriz bidimensional <i>(matriz 2d)</i>? Essa estrutura de dados oculta uma <b>fórmula de localização de dados</b> que me ajudou a evitar a <i>complexidade de tempo de O(n²)</i>, que é um cenário péssimo, transformando-a em uma <i>complexidade do tempo constante - O(1)</i>. Uma explicação completa, com casos de teste reais e testes de unidade, está esperando por você."
            }
        ]
    },
    {
        "thumbnail": "assets/posts/ai-writing.jpg",
        "http": "https://github.com/sophiawangny/cs103aSpr23TeamProjects",
        "date": "03-15-2023",
        "internationalizations": [
            {
                "language": "en",
                "title": "GPT-based Web App",
                "description": "Developed Python-based web apps using Flask, HTML/CSS, and GPT with prompt engineering, resulting in valuable user responses. Utilized Git for efficient version control and project management. Showcased proficiency in web development and collaboration skills within a team environment."
            },
            {
                "language": "pt",
                "title": "Em 2019, saia do desemprego! Seja você um Web Developer.",
                "description": "Lá estavam no mural, inúmeras vagas para desenvolvedor web. E ao mesmo tempo, haviam <b>12,7 Milhões de compatriotas desempregados</b> e tais vagas em aberto ficaram matutando em minha cabeça. De volta à minha casa, me recordo de um curso gratuito, disponibilizado pelo renomado <i>Bob Tabor (Senior Program Manager na Microsoft)</i>, presente na Microsoft Virtual Academy."
            }
        ]
    },
    {
        "thumbnail": "assets/posts/mongoose.png",
        "http": "https://github.com/areenkh/transaction",
        "date": "04-10-2023",
        "internationalizations": [
            {
                "language": "en",
                "title": "Transaction App",
                "description": "Developed Python-based web apps using Flask, HTML/CSS, and GPT with prompt engineering, resulting in valuable user responses. Utilized Git for efficient version control and project management. Showcased proficiency in web development and collaboration skills within a team environment."
            },
            {
                "language": "pt",
                "title": "Navegação por Item no Mapa para Android - <i>Componente de código aberto</i>.",
                "description": "Para uma ótima experiência do usuário, o uso de mapas junto com a lista ordenada é usado com muita frequência em aplicativos móveis. Este artigo apresenta um aplicativo de código aberto para Android que fornece um componente totalmente funcional."
            }
        ]
    },
    {
        "thumbnail": "assets/posts/SQL.png",
        "http": "https://github.com/sophiawangny/financetracker103",
        "date": "03-09-2023",
        "internationalizations": [
            {
                "language": "en",
                "title": "Finance Tracker",
                "description": "Collaborated on developing a finance tracker app, leveraging SQL for data management and pytest and pylint for automated testing and code quality. Created a Python class with comprehensive CRUD operations to effectively manage financial transactions. Ensured functionality and maintainability of the app through rigorous automated testing and linting practices."
            },
            {
                "language": "pt",
                "title": "Envio de e-mail autenticado em PHP.",
                "description": "Com a aplicação da política de segurança de email na <i>Web 2.0</i>, surgiu a necessidade de tomar medidas que dificultassem a prática do <i>spamming</i>, entre as medidas adotadas, está o uso de e-mail autenticado, o que significa que, para cada e-mail enviado, teríamos a <i>assinatura</i> do host que o enviou, assim, haveria maior controle sobre quem, eventualmente, praticasse o spam. Neste artigo, mostrarei como enviar o email de autenticação, aumentando as chances de seu email ser lido pelo usuário de destino."
            }
        ]
    }
]
