{
    "internationalizations": [
        {
            "language": "pt",
            "description": "Minha caminhada como <i>programador</i> teve início aos nove anos de idade quando me apaixonei pelo <i>Logo</i>, uma linguagem de programação educacional usada para cativar crianças nas maravilhosas terras da <i>Programação</i>. Costumava passar horas seguidas tentando criar figuras e animações, usando matemática e geometria. Naquela época, eu simplesmente não conhecia os desafios emocionantes que ainda estavam por vir.<br><br>Alguns anos depois, consegui um estágio como <i>Webmaster</i>, desde então, nunca mais parei, sendo mais de uma década, onde venho tendo a chance de trabalhar com pessoas maravilhosas, aprendendo todos os dias, viajando pelo mundo e, principalmente, sempre fazendo grandes amizades.<br><br>Tive experiência como empreendedor, quando um amigo apresentou-me <i>Magento</i>, um framework de comércio eletrônico extremamente popular. Depois de fazer vários cursos e muita prática, consegui contratos com agências de São Paulo e Rio de Janeiro, Brasil. Essa experiência de empreendedorismo me deu a chance de ver o outro lado da moeda, o que contribuiu para expandir um pouco mais minha consciência como colaborador.<br><br>Atualmente, continuo buscando novas habilidades, aprendendo e compartilhando meu humilde conhecimento, tanto quanto possível."
        },
        {
            "language": "en",
            "description": "III have always been captivated by the world of coding, starting from my early days in middle school. Since then, my passion for programming has only grown stronger. Currently pursuing a Bachelor's degree in Computer Science and Physics at Brandeis University, I have honed my skills through a diverse range of coursework and maintained an impressive GPA.<br><br>Beyond my academic achievements, I have gained practical experience that showcases my abilities. As a Website Editor at the Crown Center for Middle East Studies, I collaborated with a team to enhance website features, while my role as a Teaching Assistant allowed me to share my knowledge with others. Additionally, my internship as a Software Engineer provided me with real-world experience, where I contributed to developing innovative solutions.<br><br>Continuously seeking new challenges, I have embarked on various projects that demonstrate my proficiency in cutting-edge technologies. By developing web applications and leveraging AI capabilities, I have showcased my passion for pushing boundaries and delivering valuable user experiences.<br><br>Driven by curiosity and a determination to excel, I am eager to explore new opportunities and collaborate with talented individuals in the field of computer science. I am committed to making a meaningful contribution to the ever-evolving world of technology."
        }
    ],
    "medias": [        
        {
            "icon": "linkedin",
            "title": "LinkedIn",
            "http": "https://www.linkedin.com/in/areenkh/"
        },
        {
            "icon": "github",
            "title": "GitHub",
            "http": "https://github.com/areenkh"
        },
        {
            "icon": "facebook",
            "title": "Facebook",
            "http": "https://www.facebook.com/people/Areen-Khalaila/pfbid02MMQ6smaoRPo8gurVxH8fXS2sPod1jY25RVEKba3EVhhQs21eSKFSWR2bgLhH75C2l/"
        }
    ],
    "hobbies": [        
        {
            "icon": "guitar",
            "title": "Play Guitar"
        },
        {
            "icon": "basketball-ball",
            "title": "sports"
        },
        {
            "icon": "chess",
            "title": "chess"
        },
        {
            "icon": "book",
            "title": "Read"
        }
    ]
}